""" 1. Написати функцію < square > , яка прийматиме один аргумент - сторону квадрата,
і вертатиме 3 значення (кортеж): периметр квадрата, площа квадрата та його діагональ.
"""

def square (y):
        if (y*10)%10==0:
                x=int(y)
        else:
                x=y
        if x>0:
                v=('Периметр квадрата дорівнює',4*x, 'Площа квадрата дорівнює',x**2, 'Діагональ квадрата дорівнює',(2**0.5)*x)
        else:
                print('Введіть число більше за 0')
        print(v)
        return(v)
square(float(input('Введіть числову довжину сторони квадрата:')))

