''' 8. Написати функцію, яка буде реалізувати логіку циклічного зсуву елементів в списку. Тобто, функція приймає
два аргументи: список і величину зсуву (якщо ця величина додатня - пересуваємо з кінця на початок,
якщо від'ємна - навпаки - пересуваємо елементи з початку списку в його кінець).
   Наприклад:
       fnc([1, 2, 3, 4, 5], shift=1) --> [5, 1, 2, 3, 4]
       fnc([1, 2, 3, 4, 5], shift=-2) --> [3, 4, 5, 1, 2]
'''
def func_2(a,b):
	c=[]
	
	v=abs(b)	
	if v%10==1 and v!=11:
		d='крок'
	elif v%10==2 or v%10==3 or v%10==4:
		d='кроки'
	else:
		d='кроків'
	
	
	if b>0:
		c=list(a)
		for i in range(1,b+1):
			c.insert(0,c.pop())
			
		print('Список',a,'був зсунутий на',b,d,'з кінця на початок:',c)
	elif b<0:
		c=list(a)
		for i in range(b,0):
			c.append(c.pop(0))
		print('Список',a,'був зсунутий на',b,d,'з початку у кінець:',c)
	else:
		print('Нажаль, список не зсунувся:',a)
	return(a)
func_2(input('Введіть через пробіл елементи для створення списку:').split(),int(input('Введіть величину зсуву списку:')))
