""" 4. Створiть 3 рiзних функцiї (на ваш вибiр). Кожна з цих функцiй
повинна повертати якийсь результат. Також створiть четверу ф-цiю, яка
в тiлi викликає 3 попереднi, обробляє повернутий ними результат та також
повертає результат.
Таким чином ми будемо викликати 1 функцiю, а вона в своєму тiлi ще 3
"""
def num1 (x):
    return(x**5)
def num2(y):
    return(y+2)
def num3(z):
    return(z//3)
def num4(d):
        a=(((d-12)+num1(2))*num2(3)/num3(4))
        print(a)
        return(a)
num4(int(input()))
