'''
2. Створіть функцію для валідації пари ім'я/пароль за наступними правилами:
   - ім'я повинно бути не меншим за 3 символа і не більшим за 50;
   - пароль повинен бути не меншим за 8 символів і повинен мати хоча б одну цифру;
   - щось своє :)
   Якщо якийсь із параментів не відповідає вимогам - породити виключення із відповідним текстом.
'''

import re

class ValidException (Exception):
    pass

def func_1(**a):
    username=input("Введіть ім'я. Ім'я повинно бути не меншим за 3 символа і не більшим за 50:")
    password=input("Введіть пароль. Пароль повинен бути не меншим за 8 символів, повинен мати хоча б одну цифру та хоча б два символи:")
    a=len(re.findall(r'\d',password))
    b=len(re.findall(r'\W',password))

    if len(username)>3 and len(username)<50 and len(password)>8 and a>0 and b>1:
            print('Вимоги виконані, валідація успішна')
    else:
        raise ValidException('Виконані не всі вимоги, спробуйте ще раз')
    return()

func_1()
